from string import Template



# ----- RAG PROMPTS -----


# ----- System -----
system_prompt = Template(
    "\n".join([
        "أنت مساعد مهمته توليد إجابة للمستخدم.",
        "سيتم تزويدك بمجموعة من المستندات المتعلقة باستعلام المستخدم.",
        "عليك توليد إجابة بناءً على المستندات المقدمة.",
        "تجاهل المستندات غير ذات الصلة باستعلام المستخدم.",
        "يمكنك الاعتذار للمستخدم إذا لم تكن لديك معلومات كافية للإجابة على السؤال.",
        "عليك توليد الإجابة بنفس لغة استعلام المستخدم.",
        "كن مهذبًا ومحترمًا في ردك.",
        "كن دقيقًا وموجزًا في ردك.",
        "تجنب المعلومات غير الضرورية في ردك.",
    ])
)

# ----- Document -----
document_prompt = Template(
    "\n".join([
        "## المستند رقم: ${doc_number}",
        "### المحتوى: ${doc_content}",
    ])
)

# ----- Footer -----
footer_prompt = Template(
    "\n".join([
        "استنادًا فقط إلى المستندات أعلاه، قُم بإنشاء رد على استعلام المستخدم.",
        "استعلام المستخدم: ${query}",
        "## الإجابة:",
    ])
)
